In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\x1 yoga\anaconda3\lib\site-packages (1.4.2)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\x1 yoga\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.18.5 in c:\users\x1 yoga\anaconda3\lib\site-packages (from pandas) (1.22.4)
Requirement already satisfied: pytz>=2020.1 in c:\users\x1 yoga\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: six>=1.5 in c:\users\x1 yoga\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [2]:
import numpy as np
import pandas as pd

In [3]:
labels = ['a','b','c']

In [4]:
my_list = [10,20,30]

In [5]:
arr = np.array([10,20,30])

In [6]:
d = {'a':10,'b':20,'c':30}

## Series

In [7]:
a = pd.Series(data = my_list)

In [8]:
a[0:3]

0    10
1    20
2    30
dtype: int64

In [9]:
b = pd.Series(data = d)

In [10]:
b

a    10
b    20
c    30
dtype: int64

In [11]:
b['a']

10

In [12]:
b['c']

30

In [13]:
d = {'a':[10,40],'b':[20,50],'c':[30,60]}

In [14]:
series2 = pd.Series(d)

In [15]:
series2['a'][0]

10

In [16]:
series2['a'][1]

40

In [17]:
series3 = pd.Series(arr)

In [18]:
series3

0    10
1    20
2    30
dtype: int32

In [19]:
series3[0]

10

In [20]:
labels = ['a','b','c']

In [21]:
series4 = pd.Series(data = my_list, index = labels)

In [22]:
series4

a    10
b    20
c    30
dtype: int64

In [23]:
series4['a']

10

In [24]:
labels2 = ['first', 'second', 'third']

In [25]:
d

{'a': [10, 40], 'b': [20, 50], 'c': [30, 60]}

In [26]:
pd.Series(data = my_list, index = labels2)

first     10
second    20
third     30
dtype: int64

In [27]:
ser1 = pd.Series([1,2,3,4],['a', 'b', 'c', 'd'])

In [28]:
ser1

a    1
b    2
c    3
d    4
dtype: int64

In [29]:
ser2 = pd.Series([5,6,7,8], ['a', 'b', 'c', 'd'])

In [30]:
ser2

a    5
b    6
c    7
d    8
dtype: int64

In [31]:
ser1 + ser2

a     6
b     8
c    10
d    12
dtype: int64

In [32]:
ser3 = pd.Series([11,12,13,14])

In [33]:
ser3

0    11
1    12
2    13
3    14
dtype: int64

In [34]:
ser4 = pd.Series([1,2,3,4])

In [35]:
ser4

0    1
1    2
2    3
3    4
dtype: int64

In [36]:
ser3+ser4

0    12
1    14
2    16
3    18
dtype: int64

In [37]:
ser3+ser1

0   NaN
1   NaN
2   NaN
3   NaN
a   NaN
b   NaN
c   NaN
d   NaN
dtype: float64

In [38]:
arr1 = np.array([0,1,3,4])

In [39]:
arr1

array([0, 1, 3, 4])

In [40]:
arr2 = np.array([0,1,1,0])

In [41]:
arr1/arr2

C:\Users\X1 Yoga\AppData\Local\Temp\ipykernel_14808\3323896316.py:1: RuntimeWarning: divide by zero encountered in true_divide
  arr1/arr2
C:\Users\X1 Yoga\AppData\Local\Temp\ipykernel_14808\3323896316.py:1: RuntimeWarning: invalid value encountered in true_divide
  arr1/arr2

array([nan,  1.,  3., inf])

In [42]:
arr2/arr1

C:\Users\X1 Yoga\AppData\Local\Temp\ipykernel_14808\3928394685.py:1: RuntimeWarning: invalid value encountered in true_divide
  arr2/arr1

array([       nan, 1.        , 0.33333333, 0.        ])

## DataFrames

In [43]:
import pandas as pd
import numpy as np
np.random.seed(0)

In [44]:
np.random.randn(4,4)

array([[ 1.76405235,  0.40015721,  0.97873798,  2.2408932 ],
       [ 1.86755799, -0.97727788,  0.95008842, -0.15135721],
       [-0.10321885,  0.4105985 ,  0.14404357,  1.45427351],
       [ 0.76103773,  0.12167502,  0.44386323,  0.33367433]])

In [45]:
data = np.random.randn(4,4)

In [46]:
data

array([[ 1.49407907, -0.20515826,  0.3130677 , -0.85409574],
       [-2.55298982,  0.6536186 ,  0.8644362 , -0.74216502],
       [ 2.26975462, -1.45436567,  0.04575852, -0.18718385],
       [ 1.53277921,  1.46935877,  0.15494743,  0.37816252]])

In [47]:
pd.DataFrame(data = data)

          0         1         2         3
0  1.494079 -0.205158  0.313068 -0.854096
1 -2.552990  0.653619  0.864436 -0.742165
2  2.269755 -1.454366  0.045759 -0.187184
3  1.532779  1.469359  0.154947  0.378163

In [48]:
pd.DataFrame(data, index = ['a','b','c','d'])

          0         1         2         3
a  1.494079 -0.205158  0.313068 -0.854096
b -2.552990  0.653619  0.864436 -0.742165
c  2.269755 -1.454366  0.045759 -0.187184
d  1.532779  1.469359  0.154947  0.378163

In [49]:
pd.DataFrame(data, index = ['a','b','c','d'], columns=['W','X','Y','Z'])

          W         X         Y         Z
a  1.494079 -0.205158  0.313068 -0.854096
b -2.552990  0.653619  0.864436 -0.742165
c  2.269755 -1.454366  0.045759 -0.187184
d  1.532779  1.469359  0.154947  0.378163

In [50]:
df = pd.DataFrame(data, index = ['a','b','c','d'], columns=['W','X','Y','Z'])

In [51]:
df

          W         X         Y         Z
a  1.494079 -0.205158  0.313068 -0.854096
b -2.552990  0.653619  0.864436 -0.742165
c  2.269755 -1.454366  0.045759 -0.187184
d  1.532779  1.469359  0.154947  0.378163

In [52]:
df['W']

a    1.494079
b   -2.552990
c    2.269755
d    1.532779
Name: W, dtype: float64

In [53]:
df['Z']

a   -0.854096
b   -0.742165
c   -0.187184
d    0.378163
Name: Z, dtype: float64

In [54]:
type(df['Z'])

pandas.core.series.Series

In [55]:
df['Z']

a   -0.854096
b   -0.742165
c   -0.187184
d    0.378163
Name: Z, dtype: float64

In [56]:
df['Z']['a']

-0.8540957393017248

In [57]:
df[['W','Y']] # List -> ['W','Y']

          W         Y
a  1.494079  0.313068
b -2.552990  0.864436
c  2.269755  0.045759
d  1.532779  0.154947

In [58]:
df

          W         X         Y         Z
a  1.494079 -0.205158  0.313068 -0.854096
b -2.552990  0.653619  0.864436 -0.742165
c  2.269755 -1.454366  0.045759 -0.187184
d  1.532779  1.469359  0.154947  0.378163

In [59]:
df[['Y','Z']]

          Y         Z
a  0.313068 -0.854096
b  0.864436 -0.742165
c  0.045759 -0.187184
d  0.154947  0.378163

In [60]:
df1 = pd.read_csv(r"C:\Users\navi\Downloads\archive (4)\Travel Company New Clients.csv", sep = ';')

In [61]:
df1

,Age,Employment Type,GraduateOrNot,AnnualIncome,FamilyMembers,ChronicDiseases,FrequentFlyer,EverTravelledAbroad
0,25,Private Sector/Self Employed,No,1150000,4,0,No,No
1,34,Private Sector/Self Employed,Yes,1500000,4,1,Yes,Yes
2,33,Private Sector/Self Employed,Yes,1500000,3,0,Yes,Yes
3,28,Private Sector/Self Employed,Yes,1150000,3,0,No,No
4,33,Government Sector,Yes,400000,5,1,No,No
...,...,...,...,...,...,...,...,...
1298,33,Private Sector/Self Employed,Yes,1500000,4,0,Yes,Yes
1299,28,Private Sector/Self Employed,Yes,1750000,5,1,No,Yes
1300,28,Private Sector/Self Employed,Yes,1150000,6,1,No,No
1301,34,Private Sector/Self Employed,Yes,1000000,6,0,Yes,Yes
1302,34,Private Sector/Self Employed,Yes,500000,4,0,No,No

In [62]:
df

          W         X         Y         Z
a  1.494079 -0.205158  0.313068 -0.854096
b -2.552990  0.653619  0.864436 -0.742165
c  2.269755 -1.454366  0.045759 -0.187184
d  1.532779  1.469359  0.154947  0.378163

In [63]:
df1['Age']

0       25
1       34
2       33
3       28
4       33
        ..
1298    33
1299    28
1300    28
1301    34
1302    34
Name: Age, Length: 1303, dtype: int64

In [64]:
df1[['Age', 'Employment Type']]

      Age               Employment Type
0      25  Private Sector/Self Employed
1      34  Private Sector/Self Employed
2      33  Private Sector/Self Employed
3      28  Private Sector/Self Employed
4      33             Government Sector
...   ...                           ...
1298   33  Private Sector/Self Employed
1299   28  Private Sector/Self Employed
1300   28  Private Sector/Self Employed
1301   34  Private Sector/Self Employed
1302   34  Private Sector/Self Employed

[1303 rows x 2 columns]

In [65]:
df['W']

a    1.494079
b   -2.552990
c    2.269755
d    1.532779
Name: W, dtype: float64

In [66]:
df['Z']

a   -0.854096
b   -0.742165
c   -0.187184
d    0.378163
Name: Z, dtype: float64

In [67]:
df['W'] + df['Z']

a    0.639983
b   -3.295155
c    2.082571
d    1.910942
dtype: float64

In [68]:
df.W

a    1.494079
b   -2.552990
c    2.269755
d    1.532779
Name: W, dtype: float64

In [69]:
df1.Age

0       25
1       34
2       33
3       28
4       33
        ..
1298    33
1299    28
1300    28
1301    34
1302    34
Name: Age, Length: 1303, dtype: int64

In [70]:
df.drop('W', axis = 1)

          X         Y         Z
a -0.205158  0.313068 -0.854096
b  0.653619  0.864436 -0.742165
c -1.454366  0.045759 -0.187184
d  1.469359  0.154947  0.378163

In [71]:
df.drop('a', axis = 0)

          W         X         Y         Z
b -2.552990  0.653619  0.864436 -0.742165
c  2.269755 -1.454366  0.045759 -0.187184
d  1.532779  1.469359  0.154947  0.378163

In [72]:
df.drop('W', axis = 1, inplace = True)

In [73]:
df

          X         Y         Z
a -0.205158  0.313068 -0.854096
b  0.653619  0.864436 -0.742165
c -1.454366  0.045759 -0.187184
d  1.469359  0.154947  0.378163

In [74]:
df = pd.DataFrame(data, index = ['a','b','c','d'], columns=['W','X','Y','Z'])

In [75]:
df

          W         X         Y         Z
a  1.494079 -0.205158  0.313068 -0.854096
b -2.552990  0.653619  0.864436 -0.742165
c  2.269755 -1.454366  0.045759 -0.187184
d  1.532779  1.469359  0.154947  0.378163

In [76]:
df = df.drop('W', axis = 1)

In [77]:
df

          X         Y         Z
a -0.205158  0.313068 -0.854096
b  0.653619  0.864436 -0.742165
c -1.454366  0.045759 -0.187184
d  1.469359  0.154947  0.378163

In [78]:
df1.drop('Age', axis = 1)

,Employment Type,GraduateOrNot,AnnualIncome,FamilyMembers,ChronicDiseases,FrequentFlyer,EverTravelledAbroad
0,Private Sector/Self Employed,No,1150000,4,0,No,No
1,Private Sector/Self Employed,Yes,1500000,4,1,Yes,Yes
2,Private Sector/Self Employed,Yes,1500000,3,0,Yes,Yes
3,Private Sector/Self Employed,Yes,1150000,3,0,No,No
4,Government Sector,Yes,400000,5,1,No,No
...,...,...,...,...,...,...,...
1298,Private Sector/Self Employed,Yes,1500000,4,0,Yes,Yes
1299,Private Sector/Self Employed,Yes,1750000,5,1,No,Yes
1300,Private Sector/Self Employed,Yes,1150000,6,1,No,No
1301,Private Sector/Self Employed,Yes,1000000,6,0,Yes,Yes
1302,Private Sector/Self Employed,Yes,500000,4,0,No,No

In [79]:
df = pd.DataFrame(data, index = ['a','b','c','d'], columns=['W','X','Y','Z'])

In [80]:
df

          W         X         Y         Z
a  1.494079 -0.205158  0.313068 -0.854096
b -2.552990  0.653619  0.864436 -0.742165
c  2.269755 -1.454366  0.045759 -0.187184
d  1.532779  1.469359  0.154947  0.378163

In [81]:
df.loc['b']

W   -2.552990
X    0.653619
Y    0.864436
Z   -0.742165
Name: b, dtype: float64

In [82]:
df1

,Age,Employment Type,GraduateOrNot,AnnualIncome,FamilyMembers,ChronicDiseases,FrequentFlyer,EverTravelledAbroad
0,25,Private Sector/Self Employed,No,1150000,4,0,No,No
1,34,Private Sector/Self Employed,Yes,1500000,4,1,Yes,Yes
2,33,Private Sector/Self Employed,Yes,1500000,3,0,Yes,Yes
3,28,Private Sector/Self Employed,Yes,1150000,3,0,No,No
4,33,Government Sector,Yes,400000,5,1,No,No
...,...,...,...,...,...,...,...,...
1298,33,Private Sector/Self Employed,Yes,1500000,4,0,Yes,Yes
1299,28,Private Sector/Self Employed,Yes,1750000,5,1,No,Yes
1300,28,Private Sector/Self Employed,Yes,1150000,6,1,No,No
1301,34,Private Sector/Self Employed,Yes,1000000,6,0,Yes,Yes
1302,34,Private Sector/Self Employed,Yes,500000,4,0,No,No

In [83]:
df1.loc[0]

Age                                              25
Employment Type        Private Sector/Self Employed
GraduateOrNot                                    No
AnnualIncome                                1150000
FamilyMembers                                     4
ChronicDiseases                                   0
FrequentFlyer                                    No
EverTravelledAbroad                              No
Name: 0, dtype: object

In [84]:
df1.iloc[0]

Age                                              25
Employment Type        Private Sector/Self Employed
GraduateOrNot                                    No
AnnualIncome                                1150000
FamilyMembers                                     4
ChronicDiseases                                   0
FrequentFlyer                                    No
EverTravelledAbroad                              No
Name: 0, dtype: object

In [85]:
df1.iloc[0,0]

25

In [86]:
df1

,Age,Employment Type,GraduateOrNot,AnnualIncome,FamilyMembers,ChronicDiseases,FrequentFlyer,EverTravelledAbroad
0,25,Private Sector/Self Employed,No,1150000,4,0,No,No
1,34,Private Sector/Self Employed,Yes,1500000,4,1,Yes,Yes
2,33,Private Sector/Self Employed,Yes,1500000,3,0,Yes,Yes
3,28,Private Sector/Self Employed,Yes,1150000,3,0,No,No
4,33,Government Sector,Yes,400000,5,1,No,No
...,...,...,...,...,...,...,...,...
1298,33,Private Sector/Self Employed,Yes,1500000,4,0,Yes,Yes
1299,28,Private Sector/Self Employed,Yes,1750000,5,1,No,Yes
1300,28,Private Sector/Self Employed,Yes,1150000,6,1,No,No
1301,34,Private Sector/Self Employed,Yes,1000000,6,0,Yes,Yes
1302,34,Private Sector/Self Employed,Yes,500000,4,0,No,No

In [87]:
df1.iloc[0,0]

25

In [88]:
df1.iloc[0:11,0]

0     25
1     34
2     33
3     28
4     33
5     27
6     33
7     31
8     31
9     27
10    34
Name: Age, dtype: int64

In [89]:
df1.iloc[0:11,0:2]

    Age               Employment Type
0    25  Private Sector/Self Employed
1    34  Private Sector/Self Employed
2    33  Private Sector/Self Employed
3    28  Private Sector/Self Employed
4    33             Government Sector
5    27             Government Sector
6    33  Private Sector/Self Employed
7    31  Private Sector/Self Employed
8    31             Government Sector
9    27  Private Sector/Self Employed
10   34             Government Sector

In [90]:
df1.iloc[0:11,]

,Age,Employment Type,GraduateOrNot,AnnualIncome,FamilyMembers,ChronicDiseases,FrequentFlyer,EverTravelledAbroad
0,25,Private Sector/Self Employed,No,1150000,4,0,No,No
1,34,Private Sector/Self Employed,Yes,1500000,4,1,Yes,Yes
2,33,Private Sector/Self Employed,Yes,1500000,3,0,Yes,Yes
3,28,Private Sector/Self Employed,Yes,1150000,3,0,No,No
4,33,Government Sector,Yes,400000,5,1,No,No
5,27,Government Sector,Yes,500000,7,0,No,No
6,33,Private Sector/Self Employed,Yes,1400000,8,0,No,Yes
7,31,Private Sector/Self Employed,Yes,950000,3,0,Yes,No
8,31,Government Sector,No,300000,6,0,No,No
9,27,Private Sector/Self Employed,No,800000,5,1,No,No
10,34,Government Sector,Yes,1100000,6,1,No,No

In [91]:
df1.iloc[:,0:3]

      Age               Employment Type GraduateOrNot
0      25  Private Sector/Self Employed            No
1      34  Private Sector/Self Employed           Yes
2      33  Private Sector/Self Employed           Yes
3      28  Private Sector/Self Employed           Yes
4      33             Government Sector           Yes
...   ...                           ...           ...
1298   33  Private Sector/Self Employed           Yes
1299   28  Private Sector/Self Employed           Yes
1300   28  Private Sector/Self Employed           Yes
1301   34  Private Sector/Self Employed           Yes
1302   34  Private Sector/Self Employed           Yes

[1303 rows x 3 columns]

In [92]:
df1[['Age', 'AnnualIncome']].iloc[0:11,]

    Age  AnnualIncome
0    25       1150000
1    34       1500000
2    33       1500000
3    28       1150000
4    33        400000
5    27        500000
6    33       1400000
7    31        950000
8    31        300000
9    27        800000
10   34       1100000

In [93]:
df.loc[['a','b'],['W','X']]

          W         X
a  1.494079 -0.205158
b -2.552990  0.653619

In [94]:
df1.iloc[0:10,0:3]

   Age               Employment Type GraduateOrNot
0   25  Private Sector/Self Employed            No
1   34  Private Sector/Self Employed           Yes
2   33  Private Sector/Self Employed           Yes
3   28  Private Sector/Self Employed           Yes
4   33             Government Sector           Yes
5   27             Government Sector           Yes
6   33  Private Sector/Self Employed           Yes
7   31  Private Sector/Self Employed           Yes
8   31             Government Sector            No
9   27  Private Sector/Self Employed            No

In [95]:
df.loc[['a','b'],['W','X']]

          W         X
a  1.494079 -0.205158
b -2.552990  0.653619

In [96]:
df

          W         X         Y         Z
a  1.494079 -0.205158  0.313068 -0.854096
b -2.552990  0.653619  0.864436 -0.742165
c  2.269755 -1.454366  0.045759 -0.187184
d  1.532779  1.469359  0.154947  0.378163

In [97]:
3>0

True

In [98]:
df>0

       W      X     Y      Z
a   True  False  True  False
b  False   True  True  False
c   True  False  True  False
d   True   True  True   True

In [99]:
df['W']>0

a     True
b    False
c     True
d     True
Name: W, dtype: bool

In [100]:
df.loc['a']>0

W     True
X    False
Y     True
Z    False
Name: a, dtype: bool

In [101]:
df.loc[['a','b']]>0

       W      X     Y      Z
a   True  False  True  False
b  False   True  True  False

In [102]:
df1['Age']>30

0       False
1        True
2        True
3       False
4        True
        ...
1298     True
1299    False
1300    False
1301     True
1302     True
Name: Age, Length: 1303, dtype: bool

In [103]:
df1[df1['Age']>30]

,Age,Employment Type,GraduateOrNot,AnnualIncome,FamilyMembers,ChronicDiseases,FrequentFlyer,EverTravelledAbroad
1,34,Private Sector/Self Employed,Yes,1500000,4,1,Yes,Yes
2,33,Private Sector/Self Employed,Yes,1500000,3,0,Yes,Yes
4,33,Government Sector,Yes,400000,5,1,No,No
6,33,Private Sector/Self Employed,Yes,1400000,8,0,No,Yes
7,31,Private Sector/Self Employed,Yes,950000,3,0,Yes,No
...,...,...,...,...,...,...,...,...
1292,32,Government Sector,Yes,900000,6,0,No,No
1294,34,Private Sector/Self Employed,Yes,700000,5,0,No,No
1298,33,Private Sector/Self Employed,Yes,1500000,4,0,Yes,Yes
1301,34,Private Sector/Self Employed,Yes,1000000,6,0,Yes,Yes
1302,34,Private Sector/Self Employed,Yes,500000,4,0,No,No

In [104]:
df1[df1['FamilyMembers']==5]

,Age,Employment Type,GraduateOrNot,AnnualIncome,FamilyMembers,ChronicDiseases,FrequentFlyer,EverTravelledAbroad
4,33,Government Sector,Yes,400000,5,1,No,No
9,27,Private Sector/Self Employed,No,800000,5,1,No,No
21,27,Government Sector,Yes,850000,5,1,No,No
31,28,Private Sector/Self Employed,Yes,1200000,5,0,No,No
42,25,Private Sector/Self Employed,Yes,1700000,5,0,Yes,No
...,...,...,...,...,...,...,...,...
1287,31,Private Sector/Self Employed,Yes,950000,5,0,No,No
1288,28,Private Sector/Self Employed,Yes,800000,5,1,No,No
1294,34,Private Sector/Self Employed,Yes,700000,5,0,No,No
1296,25,Private Sector/Self Employed,No,1150000,5,1,No,No
1299,28,Private Sector/Self Employed,Yes,1750000,5,1,No,Yes

In [105]:
df1[df1['FamilyMembers']==5][['Age','AnnualIncome']]

      Age  AnnualIncome
4      33        400000
9      27        800000
21     27        850000
31     28       1200000
42     25       1700000
...   ...           ...
1287   31        950000
1288   28        800000
1294   34        700000
1296   25       1150000
1299   28       1750000

[271 rows x 2 columns]

In [106]:
df_fam5 = df1[df1['FamilyMembers']==5]

In [107]:
df_fam5[['Age', 'AnnualIncome']]

      Age  AnnualIncome
4      33        400000
9      27        800000
21     27        850000
31     28       1200000
42     25       1700000
...   ...           ...
1287   31        950000
1288   28        800000
1294   34        700000
1296   25       1150000
1299   28       1750000

[271 rows x 2 columns]

In [108]:
df[df['W']>1]

          W         X         Y         Z
a  1.494079 -0.205158  0.313068 -0.854096
c  2.269755 -1.454366  0.045759 -0.187184
d  1.532779  1.469359  0.154947  0.378163

In [109]:
df_w1 = df[df['W']>1]

In [110]:
df_w1[['X','Y']]

          X         Y
a -0.205158  0.313068
c -1.454366  0.045759
d  1.469359  0.154947

In [111]:
df[df['Z']>0][['X','Y']]

          X         Y
d  1.469359  0.154947

In [112]:
emp = df1

In [113]:
emp[emp['GraduateOrNot'] == 'Yes']

,Age,Employment Type,GraduateOrNot,AnnualIncome,FamilyMembers,ChronicDiseases,FrequentFlyer,EverTravelledAbroad
1,34,Private Sector/Self Employed,Yes,1500000,4,1,Yes,Yes
2,33,Private Sector/Self Employed,Yes,1500000,3,0,Yes,Yes
3,28,Private Sector/Self Employed,Yes,1150000,3,0,No,No
4,33,Government Sector,Yes,400000,5,1,No,No
5,27,Government Sector,Yes,500000,7,0,No,No
...,...,...,...,...,...,...,...,...
1298,33,Private Sector/Self Employed,Yes,1500000,4,0,Yes,Yes
1299,28,Private Sector/Self Employed,Yes,1750000,5,1,No,Yes
1300,28,Private Sector/Self Employed,Yes,1150000,6,1,No,No
1301,34,Private Sector/Self Employed,Yes,1000000,6,0,Yes,Yes
1302,34,Private Sector/Self Employed,Yes,500000,4,0,No,No

In [114]:
emp1 = emp[emp['GraduateOrNot'] == 'Yes']

In [115]:
list1 = ['Age','AnnualIncome']

In [116]:
emp1[list1]

      Age  AnnualIncome
1      34       1500000
2      33       1500000
3      28       1150000
4      33        400000
5      27        500000
...   ...           ...
1298   33       1500000
1299   28       1750000
1300   28       1150000
1301   34       1000000
1302   34        500000

[1111 rows x 2 columns]

In [117]:
df[df['W']>0].iloc[:,0:2]

          W         X
a  1.494079 -0.205158
c  2.269755 -1.454366
d  1.532779  1.469359

In [118]:
emp.iloc[0:10,0:2]

   Age               Employment Type
0   25  Private Sector/Self Employed
1   34  Private Sector/Self Employed
2   33  Private Sector/Self Employed
3   28  Private Sector/Self Employed
4   33             Government Sector
5   27             Government Sector
6   33  Private Sector/Self Employed
7   31  Private Sector/Self Employed
8   31             Government Sector
9   27  Private Sector/Self Employed

In [119]:
# Two Conditions

df[(df['X']>0) & (df['Z']<0)] # and -> & , or -> |

         W         X         Y         Z
b -2.55299  0.653619  0.864436 -0.742165

In [120]:
True | False # or

True

In [121]:
df[(df['X']>0) & (df['Z']<0)]

         W         X         Y         Z
b -2.55299  0.653619  0.864436 -0.742165

In [122]:
import pandas as pd

In [123]:
f = pd.Series(data = [100, 200, 300, 400, 450])

In [124]:
fruits = pd.Series(data = [100, 200, 300, 400, 450], index=['apple', 'banana', 'mango', 'grapes', 'orange'])

In [125]:
fruits['banana']

200

In [126]:
f

0    100
1    200
2    300
3    400
4    450
dtype: int64

In [127]:
f[1]

200

In [128]:
fruits

apple     100
banana    200
mango     300
grapes    400
orange    450
dtype: int64

In [129]:
fruits = pd.DataFrame({
             'Amount' : [100, 200, 300, 400, 450],
             'Vitamin': ['A','B','A','B','c']}, index= ['apple', 'banana', 'mango', 'grapes', 'orange'])

In [130]:
fruits.loc['apple']

Amount     100
Vitamin      A
Name: apple, dtype: object

In [131]:
fruits['Amount']

apple     100
banana    200
mango     300
grapes    400
orange    450
Name: Amount, dtype: int64

In [132]:
fruits['Vitamin'] == 'A'

apple      True
banana    False
mango      True
grapes    False
orange    False
Name: Vitamin, dtype: bool

In [133]:
fruits[fruits['Vitamin'] == 'A']

       Amount Vitamin
apple     100       A
mango     300       A

In [134]:
data = pd.read_csv(r"C:\Users\navi\Downloads\SampleData.csv")

In [135]:
data_50 = data[data['Units']>50]

In [136]:
data_50.iloc[0:5]

  OrderDate   Region      Rep    Item  Units  Unit Cost     Total
0    1/6/21     East    Jones  Pencil     95       1.99   189.05
4   3/15/21     West  Sorvino  Pencil     56       2.99   167.44
5    4/1/21     East    Jones  Binder     60       4.99   299.40
6   4/18/21  Central  Andrews  Pencil     75       1.99   149.25
7    5/5/21  Central  Jardine  Pencil     90       4.99   449.10

In [137]:
data_50.reset_index()

    index OrderDate   Region       Rep     Item  Units  Unit Cost       Total
0       0    1/6/21     East     Jones   Pencil     95       1.99     189.05
1       4   3/15/21     West   Sorvino   Pencil     56       2.99     167.44
2       5    4/1/21     East     Jones   Binder     60       4.99     299.40
3       6   4/18/21  Central   Andrews   Pencil     75       1.99     149.25
4       7    5/5/21  Central   Jardine   Pencil     90       4.99     449.10
5       9    6/8/21     East     Jones   Binder     60       8.99     539.40
6      10   6/25/21  Central    Morgan   Pencil     90       4.99     449.10
7      12   7/29/21     East    Parent   Binder     81      19.99   1,619.19
8      17  10/22/21     East     Jones      Pen     64       8.99     575.36
9      19  11/25/21  Central    Kivell  Pen Set     96       4.99     479.04
10     20  12/12/21  Central     Smith   Pencil     67       1.29      86.43
11     21  12/29/21     East    Parent  Pen Set     74      15.99   1,183.26
12     23    2/1/22  Central     Smith   Binder     87      15.00   1,305.00
13     27   4/10/22  Central   Andrews   Pencil     66       1.99     131.34
14     28   4/27/22     East    Howard      Pen     96       4.99     479.04
15     29   5/14/22  Central      Gill   Pencil     53       1.29      68.37
16     30   5/31/22  Central      Gill   Binder     80       8.99     719.20
17     32    7/4/22     East     Jones  Pen Set     62       4.99     309.38
18     33   7/21/22  Central    Morgan  Pen Set     55      12.49     686.95
19     37   9/27/22     West   Sorvino      Pen     76       1.99     151.24
20     38  10/14/22     West  Thompson   Binder     57      19.99   1,139.43
21     41   12/4/22  Central   Jardine   Binder     94      19.99   1,879.06

In [138]:
data = pd.read_csv(r"C:\Users\navi\Downloads\SampleData.csv", index_col='OrderDate')

In [139]:
data

            Region       Rep     Item  Units  Unit Cost       Total
OrderDate
1/6/21        East     Jones   Pencil     95       1.99     189.05
1/23/21    Central    Kivell   Binder     50      19.99     999.50
2/9/21     Central   Jardine   Pencil     36       4.99     179.64
2/26/21    Central      Gill      Pen     27      19.99     539.73
3/15/21       West   Sorvino   Pencil     56       2.99     167.44
4/1/21        East     Jones   Binder     60       4.99     299.40
4/18/21    Central   Andrews   Pencil     75       1.99     149.25
5/5/21     Central   Jardine   Pencil     90       4.99     449.10
5/22/21       West  Thompson   Pencil     32       1.99      63.68
6/8/21        East     Jones   Binder     60       8.99     539.40
6/25/21    Central    Morgan   Pencil     90       4.99     449.10
7/12/21       East    Howard   Binder     29       1.99      57.71
7/29/21       East    Parent   Binder     81      19.99   1,619.19
8/15/21       East     Jones   Pencil     35       4.99     174.65
9/1/21     Central     Smith     Desk      2     125.00     250.00
9/18/21       East     Jones  Pen Set     16      15.99     255.84
10/5/21    Central    Morgan   Binder     28       8.99     251.72
10/22/21      East     Jones      Pen     64       8.99     575.36
11/8/21       East    Parent      Pen     15      19.99     299.85
11/25/21   Central    Kivell  Pen Set     96       4.99     479.04
12/12/21   Central     Smith   Pencil     67       1.29      86.43
12/29/21      East    Parent  Pen Set     74      15.99   1,183.26
1/15/22    Central      Gill   Binder     46       8.99     413.54
2/1/22     Central     Smith   Binder     87      15.00   1,305.00
2/18/22       East     Jones   Binder      4       4.99      19.96
3/7/22        West   Sorvino   Binder      7      19.99     139.93
3/24/22    Central   Jardine  Pen Set     50       4.99     249.50
4/10/22    Central   Andrews   Pencil     66       1.99     131.34
4/27/22       East    Howard      Pen     96       4.99     479.04
5/14/22    Central      Gill   Pencil     53       1.29      68.37
5/31/22    Central      Gill   Binder     80       8.99     719.20
6/17/22    Central    Kivell     Desk      5     125.00     625.00
7/4/22        East     Jones  Pen Set     62       4.99     309.38
7/21/22    Central    Morgan  Pen Set     55      12.49     686.95
8/7/22     Central    Kivell  Pen Set     42      23.95   1,005.90
8/24/22       West   Sorvino     Desk      3     275.00     825.00
9/10/22    Central      Gill   Pencil      7       1.29       9.03
9/27/22       West   Sorvino      Pen     76       1.99     151.24
10/14/22      West  Thompson   Binder     57      19.99   1,139.43
10/31/22   Central   Andrews   Pencil     14       1.29      18.06
11/17/22   Central   Jardine   Binder     11       4.99      54.89
12/4/22    Central   Jardine   Binder     94      19.99   1,879.06
12/21/22   Central   Andrews   Binder     28       4.99     139.72

In [140]:
data = pd.read_csv(r"C:\Users\navi\Downloads\SampleData.csv")

In [141]:
fruits = fruits.reset_index()

In [142]:
fruits = fruits.drop('level_0', axis = 1)

KeyError: "['level_0'] not found in axis"

In [ ]:
fruits['Name'] = fruits['index']

In [ ]:
fruits = fruits.drop('index', axis = 1)

In [ ]:
fruits[fruits['Amount'] <= 300]

In [ ]:
fruits

In [ ]:
fruits = fruits.set_index('Name')

In [ ]:
fruits.drop('apple', axis = 0)

In [143]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [144]:
out = ['A', 'A', 'B', 'B', 'B']
in_ = [1,1,2,2,1]

list(zip(out,in_))

[('A', 1), ('A', 1), ('B', 2), ('B', 2), ('B', 1)]

In [145]:
a = pd.MultiIndex.from_tuples(list(zip(out,in_)))

In [146]:
a

MultiIndex([('A', 1),
            ('A', 1),
            ('B', 2),
            ('B', 2),
            ('B', 1)],
           )

In [147]:
import numpy as np

data = np.random.randn(12).reshape(6,2)
data

array([[-0.88778575, -1.98079647],
       [-0.34791215,  0.15634897],
       [ 1.23029068,  1.20237985],
       [-0.38732682, -0.30230275],
       [-1.04855297, -1.42001794],
       [-1.70627019,  1.9507754 ]])

In [148]:
df = pd.DataFrame(data, index = a, columns = ['A','B'])

ValueError: Shape of passed values is (6, 2), indices imply (5, 2)

In [149]:
df

          W         X         Y         Z
a  1.494079 -0.205158  0.313068 -0.854096
b -2.552990  0.653619  0.864436 -0.742165
c  2.269755 -1.454366  0.045759 -0.187184
d  1.532779  1.469359  0.154947  0.378163

In [150]:
df = pd.DataFrame(data, index = hier_index, columns = ['A','B'])

In [151]:
df

             A         B
G1 1 -0.887786 -1.980796
   2 -0.347912  0.156349
   3  1.230291  1.202380
G2 1 -0.387327 -0.302303
   2 -1.048553 -1.420018
   3 -1.706270  1.950775

In [152]:
df.loc['G2'].loc[3]

A   -1.706270
B    1.950775
Name: 3, dtype: float64

In [156]:
import numpy as np

data = np.random.randn(12).reshape(6,2)

In [157]:
data

array([[-0.90729836,  0.0519454 ],
       [ 0.72909056,  0.12898291],
       [ 1.13940068, -1.23482582],
       [ 0.40234164, -0.68481009],
       [-0.87079715, -0.57884966],
       [-0.31155253,  0.05616534]])

In [161]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]

list(zip(outside, inside))

index = pd.MultiIndex.from_tuples(list(zip(outside, inside)))

In [164]:
df = pd.DataFrame(data=data, index=index, columns= ['A', 'B'])

In [171]:
df.index.names

FrozenList([None, None])

In [193]:
df.index.names = ['L1', 'L2']

In [194]:
df

              A         B
L1 L2
G1 1  -0.907298  0.051945
   2   0.729091  0.128983
   3   1.139401 -1.234826
G2 1   0.402342 -0.684810
   2  -0.870797 -0.578850
   3  -0.311553  0.056165

In [195]:
df.xs('G1')

           A         B
L2
1  -0.907298  0.051945
2   0.729091  0.128983
3   1.139401 -1.234826

In [196]:
df

              A         B
L1 L2
G1 1  -0.907298  0.051945
   2   0.729091  0.128983
   3   1.139401 -1.234826
G2 1   0.402342 -0.684810
   2  -0.870797 -0.578850
   3  -0.311553  0.056165

In [197]:
df

              A         B
L1 L2
G1 1  -0.907298  0.051945
   2   0.729091  0.128983
   3   1.139401 -1.234826
G2 1   0.402342 -0.684810
   2  -0.870797 -0.578850
   3  -0.311553  0.056165

In [210]:
df.xs(1,level='L2')

           A         B
L1
G1 -0.907298  0.051945
G2  0.402342 -0.684810

In [199]:
df.loc['G1'].loc[1]

A   -0.907298
B    0.051945
Name: 1, dtype: float64

In [200]:
df

              A         B
L1 L2
G1 1  -0.907298  0.051945
   2   0.729091  0.128983
   3   1.139401 -1.234826
G2 1   0.402342 -0.684810
   2  -0.870797 -0.578850
   3  -0.311553  0.056165

In [204]:
df.xs('G1',level = 'L1')

           A         B
L2
1  -0.907298  0.051945
2   0.729091  0.128983
3   1.139401 -1.234826

In [205]:
df.xs('G2', level = 'L1')

           A         B
L2
1   0.402342 -0.684810
2  -0.870797 -0.578850
3  -0.311553  0.056165

In [209]:
df.xs(3, level = 'L2')

           A         B
L1
G1  1.139401 -1.234826
G2 -0.311553  0.056165